<?php

/* 1. Создайте переменные $a=10, $b=2 и $c=5.
 Выведите на экран их сумму
*/

$a = 10;
$b = 2;
$c = 5;

echo $a + $b + $c . PHP_EOL;

/*
2. Создайте переменные $a=17 и $b=10.
Отнимите от $a переменную $b и результат присвойте переменной $c.
Затем создайте переменную $d, присвойте ей значение
7. Сложите переменные $c и $d, а результат запишите в переменную $result.
Выведите на экран значение переменной $result.
 */

$a = 17;
$b = 10;
$c = $a - $b;
$d = 7;
$result = $c + $d;

echo $result . PHP_EOL;

/*
3. Создайте переменные $text1='Привет, ' и $text2='Мир!'.
С помощью этих переменных и операции сложения строк выведите на экран фразу
 */


